
#### Terraform Plan
<details>
<summary>Expand</summary>

```
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/timovink/infra-shared/runs/run-jquA6mdAUHMjpgWy

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
module.global_certificate["timovink.app"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/ed6e0edc-3d1a-41fd-900a-9342fcb09642]
module.global_certificate["timovink.dev"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/c37f96fe-c8d6-4cfa-a752-9b95610577d1]
module.global_certificate["timovink.com"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/b5424589-49e4-41be-aed5-4e0387f5e995]
module.global_certificate["timovink.ca"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/c14c4e0f-400b-415b-bdf9-f5b38995b474]
module.domain_redirects.aws_cloudfront_function.redirect: Refreshing state... [id=tv-sharedinfra-redirecttoprimary]
module.local_certificate["timovink.ca"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/1d5e180f-aceb-44e7-93ff-d116ec4132dc]
module.local_certificate["timovink.app"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/a5f9fd0b-1fac-49d1-beba-b87ce4550483]
module.iam.aws_iam_user.tvink: Refreshing state... [id=tvink]
module.iam.aws_iam_user.deployer: Refreshing state... [id=deployer]
module.dns["timovink.app"].aws_route53_zone.this: Refreshing state... [id=Z090672659X2JIXVUFX0]
module.local_certificate["timovink.com"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/9cf0da07-dfd0-4ffd-bc97-1d53a1c498cb]
module.dns["timovink.ca"].aws_route53_zone.this: Refreshing state... [id=Z08658091IB2VPYFZRTIS]
module.local_certificate["timovink.dev"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/bf00816d-2214-47e9-9533-e82bf38b838e]
module.iam.aws_iam_group.administrators: Refreshing state... [id=administrators]
module.dns["timovink.dev"].aws_route53_zone.this: Refreshing state... [id=Z09071302Y5GD83DY6NXW]
module.dns["timovink.com"].aws_route53_zone.this: Refreshing state... [id=ZFMCDCUJ8UCFO]
module.iam.aws_iam_group_policy_attachment.administrators: Refreshing state... [id=administrators-20220605021751233100000001]
module.iam.aws_iam_user_group_membership.tvink: Refreshing state... [id=terraform-20220605021751235700000002]
module.iam.aws_iam_user_group_membership.deployer: Refreshing state... [id=terraform-20220604232226591200000002]
module.global_certificate["timovink.dev"].aws_route53_record.validation["*.timovink.dev"]: Refreshing state... [id=Z09071302Y5GD83DY6NXW__aec79ae1e60595e5c546c99005405cb2.timovink.dev._CNAME]
module.global_certificate["timovink.app"].aws_route53_record.validation["*.timovink.app"]: Refreshing state... [id=Z090672659X2JIXVUFX0__898a605fd844d2311876cf17ced2654a.timovink.app._CNAME]
module.global_certificate["timovink.com"].aws_route53_record.validation["*.timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO__d792b113bb70820125d76b1d48a01fcb.timovink.com._CNAME]
module.global_certificate["timovink.app"].aws_route53_record.validation["timovink.app"]: Refreshing state... [id=Z090672659X2JIXVUFX0__898a605fd844d2311876cf17ced2654a.timovink.app._CNAME]
module.global_certificate["timovink.dev"].aws_route53_record.validation["timovink.dev"]: Refreshing state... [id=Z09071302Y5GD83DY6NXW__aec79ae1e60595e5c546c99005405cb2.timovink.dev._CNAME]
module.global_certificate["timovink.com"].aws_route53_record.validation["timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO__d792b113bb70820125d76b1d48a01fcb.timovink.com._CNAME]
module.global_certificate["timovink.ca"].aws_route53_record.validation["timovink.ca"]: Refreshing state... [id=Z08658091IB2VPYFZRTIS__78aa3e24a54e517847b5c3573be744e9.timovink.ca._CNAME]
module.global_certificate["timovink.ca"].aws_route53_record.validation["*.timovink.ca"]: Refreshing state... [id=Z08658091IB2VPYFZRTIS__78aa3e24a54e517847b5c3573be744e9.timovink.ca._CNAME]
module.local_certificate["timovink.app"].aws_route53_record.validation["*.timovink.app"]: Refreshing state... [id=Z090672659X2JIXVUFX0__898a605fd844d2311876cf17ced2654a.timovink.app._CNAME]
module.local_certificate["timovink.app"].aws_route53_record.validation["timovink.app"]: Refreshing state... [id=Z090672659X2JIXVUFX0__898a605fd844d2311876cf17ced2654a.timovink.app._CNAME]
module.local_certificate["timovink.com"].aws_route53_record.validation["*.timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO__d792b113bb70820125d76b1d48a01fcb.timovink.com._CNAME]
module.local_certificate["timovink.com"].aws_route53_record.validation["timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO__d792b113bb70820125d76b1d48a01fcb.timovink.com._CNAME]
module.local_certificate["timovink.ca"].aws_route53_record.validation["*.timovink.ca"]: Refreshing state... [id=Z08658091IB2VPYFZRTIS__78aa3e24a54e517847b5c3573be744e9.timovink.ca._CNAME]
module.local_certificate["timovink.ca"].aws_route53_record.validation["timovink.ca"]: Refreshing state... [id=Z08658091IB2VPYFZRTIS__78aa3e24a54e517847b5c3573be744e9.timovink.ca._CNAME]
module.local_certificate["timovink.dev"].aws_route53_record.validation["*.timovink.dev"]: Refreshing state... [id=Z09071302Y5GD83DY6NXW__aec79ae1e60595e5c546c99005405cb2.timovink.dev._CNAME]
module.local_certificate["timovink.dev"].aws_route53_record.validation["timovink.dev"]: Refreshing state... [id=Z09071302Y5GD83DY6NXW__aec79ae1e60595e5c546c99005405cb2.timovink.dev._CNAME]
module.global_certificate["timovink.dev"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.global_certificate["timovink.ca"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.global_certificate["timovink.app"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.global_certificate["timovink.com"].aws_acm_certificate_validation.this: Refreshing state... [id=2022-06-05 03:29:25.278 +0000 UTC]
module.domain_redirects.aws_cloudfront_distribution.this["timovink.com"]: Refreshing state... [id=E200E95Q71F1CC]
module.domain_redirects.aws_cloudfront_distribution.this["timovink.app"]: Refreshing state... [id=EA449TJZFYK4B]
module.domain_redirects.aws_cloudfront_distribution.this["timovink.ca"]: Refreshing state... [id=E13S2CRFR1K2EJ]
module.local_certificate["timovink.ca"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.local_certificate["timovink.com"].aws_acm_certificate_validation.this: Refreshing state... [id=2022-06-05 03:29:26.207 +0000 UTC]
module.local_certificate["timovink.app"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.local_certificate["timovink.dev"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.domain_redirects.aws_cloudfront_distribution.this["timovink.app"] has changed
  ~ resource "aws_cloudfront_distribution" "this" {
      ~ etag                           = "ESNGNCUCIW1FG" -> "E1SVR5FP7OHFA4"
        id                             = "EA449TJZFYK4B"
        tags                           = {}
        # (17 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.domain_redirects.aws_cloudfront_distribution.this["timovink.ca"] has changed
  ~ resource "aws_cloudfront_distribution" "this" {
      ~ etag                           = "E8YD646YBIZ9Y" -> "E1PQMO48U2EXUT"
        id                             = "E13S2CRFR1K2EJ"
        tags                           = {}
        # (17 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.domain_redirects.aws_cloudfront_distribution.this["timovink.com"] has changed
  ~ resource "aws_cloudfront_distribution" "this" {
      ~ etag                           = "EHHC48IT3NKYZ" -> "E2TLAM8D62Z100"
        id                             = "E200E95Q71F1CC"
        tags                           = {}
        # (17 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.domain_redirects.aws_route53_record.this["timovink.app"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "timovink.app"
      + type            = "A"
      + zone_id         = "Z090672659X2JIXVUFX0"

      + alias {
          + evaluate_target_health = false
          + name                   = "d1l21qbstozdu6.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # module.domain_redirects.aws_route53_record.this["timovink.ca"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "timovink.ca"
      + type            = "A"
      + zone_id         = "Z08658091IB2VPYFZRTIS"

      + alias {
          + evaluate_target_health = false
          + name                   = "d2bfxhe1sagpyh.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # module.domain_redirects.aws_route53_record.this["timovink.com"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "timovink.com"
      + type            = "A"
      + zone_id         = "ZFMCDCUJ8UCFO"

      + alias {
          + evaluate_target_health = false
          + name                   = "d9mlkg81u40c3.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>